# Purpose

Students have the option of using Pandas and SQL to complete this project. A Phase 1 project done completely in pandas, completely in SQL, or a mixture of the two can all be considered a fine Phase 1 project. This notebook serves as a resource for setting up an SQL database for students who wish to use SQL in their Phase 1 project.

**To create the `movies.db` database, run the code cells below.**
> The Entity Relational Diagram is below

In [1]:
from src.make_db import create_movies_db
import pandas as pd

In [2]:
create_movies_db()

imdb_title_principals table created successfully....
imdb_name_basic table created successfully....
imdb_title_crew table created successfully....
imdb_title_ratings table created successfully....
imdb_title_basics table created successfully....
imdb_title_akas table created successfully....
tn_movie_budgets table created successfully....
tmdb_movies table created successfully....
bom_movie_gross table created successfully....
rotten_tomatoes_critic_reviews table created successfully....
rotten_tomatoes_movies table created successfully....
=========================================================
Inserting data into the imdb_title_crew table....
Inserting data into the tmdb_movies table....
Inserting data into the imdb_title_akas table....
Inserting data into the imdb_title_ratings table....
Inserting data into the imdb_name_basics table....
Inserting data into the rotten_tomatoes_movies table....
Inserting data into the rotten_tomatoes_critic_reviews table....
Inserting data into the imdb_title_basics table....
Inserting data into the tn_movie_budgets table....
Inserting data into the bom_movie_gross table....
Inserting data into the imdb_title_principals table....
=========================================================
Database created successfully!
To connect to the database: open a connection using the path "data/movies.db"

![movies.db schema](images/movies_db_schema.png)

In [3]:
#Importing all the packages I need
import sqlite3
import pandas as pd
import numpy as np

In [4]:
#Importing the data
conn = sqlite3.connect('data/movies.db')
cur = conn.cursor()
df = pd.read_sql('''SELECT * 
FROM bom_movie_gross 
WHERE foreign_gross IS NOT NULL''',conn)
df

,idx,title,studio,domestic_gross,foreign_gross,year
0,0,Toy Story 3,BV,415000000.0,652000000,2010
1,1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,3,Inception,WB,292600000.0,535700000,2010
4,4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...,...
2032,3275,I Still See You,LGF,1400.0,1500000,2018
2033,3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
2034,3309,Time Freak,Grindstone,10000.0,256000,2018
2035,3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
2036,3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

In [7]:
df['worldwide_gross'] = df['worldwide_gross'].str.replace('$', '').str.replace(',', '')
df['worldwide_gross'] = df['worldwide_gross'].astype(int)

In [10]:
#movies in order of worldwide gross
cur.execute('''SELECT movie, worldwide_gross
FROM tn_movie_budgets 
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(10)

In [ ]:
runtime = cur.execute('''
SELECT runtime_minutes, original_title 
FROM imdb_title_basics
ORDER BY runtime_minutes DESC ;
''')
runtime = pd.DataFrame(cur.fetchall())
runtime.columns = [i[0] for i in cur.description]
runtime.head(10)

In [ ]:
rtandgross['worldwide_gross'] = rtandgross['worldwide_gross'].str.replace('$', '').str.replace(',', '')
rtandgross['worldwide_gross'] = rtandgross['worldwide_gross'].astype(int)

In [11]:

rtandgross = cur.execute('''
SELECT runtime_minutes, original_title, worldwide_gross
FROM imdb_title_basics JOIN tn_movie_budgets 
ON original_title = movie 
''')
rtandgross = pd.DataFrame(cur.fetchall())
rtandgross.columns = [i[0] for i in cur.description]
rtandgross.head(10)
rtandgross['worldwide_gross'] = rtandgross['worldwide_gross'].str.replace('$', '').str.replace(',', '')
rtandgross['worldwide_gross'] = rtandgross['worldwide_gross'].astype(int)

In [12]:
rtandgross.head(10)

   runtime_minutes                   original_title  worldwide_gross
0             91.0                       Foodfight!            73706
1              NaN                    Mortal Kombat        122133227
2             88.0                    The Overnight          1165996
3            124.0                      On the Road          9313302
4            114.0  The Secret Life of Walter Mitty        187861183
5            114.0      A Walk Among the Tombstones         62108587
6            124.0                   Jurassic World       1648854864
7            119.0                    The Rum Diary         21544732
8             92.0                The Three Stooges         54052249
9             98.0                 Anderson's Cross                0

In [14]:
orderedrtandgross =rtandgross.sort_values('worldwide_gross', ascending=False)
orderedrtandgross.head(10)

      runtime_minutes                  original_title  worldwide_gross
1734              NaN                         Titanic       2208208395
3414            115.0                         Titanic       2208208395
2416            149.0          Avengers: Infinity War       2048134200
6               124.0                  Jurassic World       1648854864
97              143.0                    The Avengers       1517935897
1664            141.0         Avengers: Age of Ultron       1403013963
1069            134.0                   Black Panther       1348258224
2645            128.0  Jurassic World: Fallen Kingdom       1305772799
469              93.0                          Frozen       1272469910
1553            102.0                          Frozen       1272469910